ogautherot/latticeice40-fw/include/lpc11u67.h
/**
 * LPC824 registers mapping
 */

#ifndef __LPC11U67_H_INCLUDED__
#define __LPC11U67_H_INCLUDED__

#include <stdint.h>

#define __I volatile
#define __IO volatile
#define __O volatile const

/* Base address of the various peripherals
 * */

#define I2C0_BASE (0x40000000)
#define WWDT_BASE (0x40004000)
#define USART0_BASE (0x40008000)
#define CT16B0_BASE (0x4000c000)
#define CT16B1_BASE (0x40010000)
#define CT32B0_BASE (0x40014000)
#define CT32B1_BASE (0x40018000)
#define ADC_BASE (0x4001c000)
#define I2C1_BASE (0x40020000)
#define RTC_BASE (0x40024000)
#define DMA_TRIGMUX_BASE (0x40028000)
#define PMU_BASE (0x40038000)
#define FLASH_CTLR_BASE (0x4003c000)
#define SSP0_BASE (0x40040000)
#define IOCON_BASE (0x40044000)
#define SYSCON_BASE (0x40048000)
#define USART4_BASE (0x4004c000)
#define SSP1_BASE (0x40058000)
#define GPIO_GRP0_BASE (0x4005c000)
#define GPIO_GRP1_BASE (0x40060000)
#define USART1_BASE (0x4006c000)
#define USART2_BASE (0x40070000)
#define USART3_BASE (0x40074000)
#define USB_BASE (0x40080000)
#define CRC_BASE (0x50000000)
#define DMA_BASE (0x50004000)
#define SCT0_BASE (0x5000c000)
#define SCT1_BASE (0x5000e000)
#define GPIO0_BASE (0xa0000000)      // GPIO
#define GPIO0_PINT_BASE (0xa0004000) // GPIO PINT

#define NVIC_BASE (0xe000e000)

// MTB - Micro-Trace Buffer

#pragma GCC warning "Temp sensor"

// CT16B

typedef struct Ct16bStruct
{
  __IO uint32_t ir;  // 0x00
  __IO uint32_t tcr; // 0x04
  __IO uint32_t tc;  // 0x08
  __IO uint32_t pr;  // 0x0c
  __IO uint32_t pc;  // 0x10
  __IO uint32_t mcr; // 0x14
  __IO uint32_t mr0; // 0x18
  __IO uint32_t mr1; // 0x1c

  __IO uint32_t mr2; // 0x20
  __IO uint32_t mr3; // 0x24
  __IO uint32_t ccr; // 0x28
  __IO uint32_t cr0; // 0x2c
  __IO uint32_t cr1; // 0x30
  __IO uint32_t cr2; // 0x34, CT16B0 only
  uint32_t : 32;     // 0x38
  __IO uint32_t emr; // 0x3c

  uint32_t : 32; // 0x40
  uint32_t : 32; // 0x44
  uint32_t : 32; // 0x48
  uint32_t : 32; // 0x4c
  uint32_t : 32; // 0x50
  uint32_t : 32; // 0x54
  uint32_t : 32; // 0x58
  uint32_t : 32; // 0x5c

  uint32_t : 32;      // 0x60
  uint32_t : 32;      // 0x64
  uint32_t : 32;      // 0x68
  uint32_t : 32;      // 0x6c
  __IO uint32_t ctcr; // 0x70
  __IO uint32_t pmwc; // 0x74
} Ct16bStruct;

#define CT16B0 ((Ct16bStruct *)CT16B0_BASE)
#define CT16B1 ((Ct16bStruct *)CT16B1_BASE)

// CT32B

typedef struct Ct32bStruct
{
  __IO uint32_t ir;  // 0x00
  __IO uint32_t tcr; // 0x04
  __IO uint32_t tc;  // 0x08
  __IO uint32_t pr;  // 0x0c
  __IO uint32_t pc;  // 0x10
  __IO uint32_t mcr; // 0x14
  __IO uint32_t mr0; // 0x18
  __IO uint32_t mr1; // 0x1c

  __IO uint32_t mr2; // 0x20
  __IO uint32_t mr3; // 0x24
  __IO uint32_t ccr; // 0x28
  __IO uint32_t cr0; // 0x2c
  __IO uint32_t cr1; // 0x30
  __IO uint32_t cr2; // 0x34, CT32B0 only
  uint32_t : 32;     // 0x38
  __IO uint32_t emr; // 0x3c

  uint32_t : 32; // 0x40
  uint32_t : 32; // 0x44
  uint32_t : 32; // 0x48
  uint32_t : 32; // 0x4c
  uint32_t : 32; // 0x50
  uint32_t : 32; // 0x54
  uint32_t : 32; // 0x58
  uint32_t : 32; // 0x5c

  uint32_t : 32;      // 0x60
  uint32_t : 32;      // 0x64
  uint32_t : 32;      // 0x68
  uint32_t : 32;      // 0x6c
  __IO uint32_t ctcr; // 0x70
  __IO uint32_t pmwc; // 0x74
} Ct32bStruct;

#define CT32B0 ((Ct32bStruct *)CT32B0_BASE)
#define CT32B1 ((Ct32bStruct *)CT32B1_BASE)

// RTC

typedef struct RtcStruct
{
  __IO uint32_t ctrl;  // 0x00
  __IO uint32_t match; // 0x04
  __IO uint32_t count; // 0x08
  __IO uint32_t wake;  // 0x0c
} RtcStruct;

#define RTC ((RtcStruct *)RTC_BASE)

// WWDT - Windowed Watch Dog Timer

typedef struct WwdtStruct
{
  __IO uint32_t mod;     // 0x00
  __IO uint32_t tc;      // 0x04
  __I uint32_t feed;     // 0x08
  __O uint32_t tv;       // 0x0c
  __IO uint32_t clksel;  // 0x10
  __IO uint32_t warnint; // 0x14
  __IO uint32_t window;  // 0x18
} WwdtStruct;

#define WWDT ((WwdtStruct *)WWDT_BASE)

// ADC

typedef struct AdcStruct
{
  __IO uint32_t ctrl;        // 0x00
  uint32_t : 32;             // 0x04
  __IO uint32_t seqa_ctrl;   // 0x08
  __IO uint32_t seqb_ctrl;   // 0x0c
  __IO uint32_t seqa_gdat;   // 0x10
  __IO uint32_t seqb_gdat;   // 0x14
  uint32_t : 32;             // 0x18
  uint32_t : 32;             // 0x1c
  __O uint32_t dat0;         // 0x20
  __O uint32_t dat1;         // 0x24
  __O uint32_t dat2;         // 0x28
  __O uint32_t dat3;         // 0x2c
  __O uint32_t dat4;         // 0x30
  __O uint32_t dat5;         // 0x34
  __O uint32_t dat6;         // 0x38
  __O uint32_t dat7;         // 0x3c
  __O uint32_t dat8;         // 0x40
  __O uint32_t dat9;         // 0x44
  __O uint32_t dat10;        // 0x48
  __O uint32_t dat11;        // 0x4c
  __IO uint32_t thr0_low;    // 0x50
  __IO uint32_t thr1_low;    // 0x54
  __IO uint32_t thr0_high;   // 0x58
  __IO uint32_t thr1_high;   // 0x5c
  __IO uint32_t chan_thrsel; // 0x60
  __IO uint32_t inten;       // 0x64
  __IO uint32_t flags;       // 0x68
  __IO uint32_t trm;         // 0x6c
} AdcStruct;

#define ADC ((AdcStruct *)ADC_BASE)

// PMU

typedef struct PmuStruct
{
  __IO uint32_t pcon;    // 0x00
  __IO uint32_t gpreg0;  // 0x04
  __IO uint32_t gpreg1;  // 0x08
  __IO uint32_t gpreg2;  // 0x0c
  __IO uint32_t gpreg3;  // 0x10
  __IO uint32_t dpdctrl; // 0x14
} PmuStruct;

#define PMU ((PmuStruc *)PMU_BASE)

// DMA Trigger Mux

typedef struct DmaTrigMuxStruct
{
  __IO uint32_t inmux0;  // 0x00
  __IO uint32_t inmux1;  // 0x04
  __IO uint32_t inmux2;  // 0x08
  __IO uint32_t inmux3;  // 0x0c
  __IO uint32_t inmux4;  // 0x10
  __IO uint32_t inmux5;  // 0x14
  __IO uint32_t inmux6;  // 0x18
  __IO uint32_t inmux7;  // 0x1c
  __IO uint32_t inmux8;  // 0x20
  __IO uint32_t inmux9;  // 0x24
  __IO uint32_t inmux10; // 0x28
  __IO uint32_t inmux11; // 0x2c
  __IO uint32_t inmux12; // 0x30
  __IO uint32_t inmux13; // 0x34
  __IO uint32_t inmux14; // 0x38
  __IO uint32_t inmux15; // 0x3c
} DmaTrigMuxStruct;

#define DMA_TRIGMUX ((DmaTrigMuxStruct *)DMA_TRIGMUX_BASE)

// Flash controller

typedef struct FlashCtlStruct
{
  uint32_t : 32;          // 0x00
  uint32_t : 32;          // 0x04
  uint32_t : 32;          // 0x08
  __IO uint32_t flashcfg; // 0x0c
  uint32_t : 32;          // 0x10
  uint32_t : 32;          // 0x14
  uint32_t : 32;          // 0x18
  uint32_t : 32;          // 0x1c
  __IO uint32_t fmsstart; // 0x20
  __IO uint32_t fmsstop;  // 0x24
  uint32_t : 32;          // 0x28
  __O uint32_t fmsw0;     // 0x2c
} FlashCtrlStruct;

