ogautherot/latticeice40-fw/include/lpc11u67.h
#define FLASH_CTRL ((FlashCtrlStruct *)FLASH_CTRL_BASE)

// IOCON

typedef struct IoconStruct
{
  __IO uint32_t reset_pio0_0; // 0x00
  __IO uint32_t pio0_01;      // 0x04
  __IO uint32_t pio0_02;      // 0x08
  __IO uint32_t pio0_03;      // 0x0c
  __IO uint32_t pio0_04;      // 0x10
  __IO uint32_t pio0_05;      // 0x14
  __IO uint32_t pio0_06;      // 0x18
  __IO uint32_t pio0_07;      // 0x1c

  __IO uint32_t pio0_08;       // 0x20
  __IO uint32_t pio0_09;       // 0x24
  __IO uint32_t swclk_pio0_10; // 0x28
  __IO uint32_t tdi_pio0_11;   // 0x2c
  __IO uint32_t tms_pio0_12;   // 0x30
  __IO uint32_t tdo_pio0_13;   // 0x34
  __IO uint32_t trst_pio0_14;  // 0x38
  __IO uint32_t swdio_pio0_15; // 0x3c

  __IO uint32_t pio0_16; // 0x40
  __IO uint32_t pio0_17; // 0x44
  __IO uint32_t pio0_18; // 0x48
  __IO uint32_t pio0_19; // 0x4c
  __IO uint32_t pio0_20; // 0x50
  __IO uint32_t pio0_21; // 0x54
  __IO uint32_t pio0_22; // 0x58
  __IO uint32_t pio0_23; // 0x5c

  __IO uint32_t pio1_00; // 0x60
  __IO uint32_t pio1_01; // 0x64
  __IO uint32_t pio1_02; // 0x68
  __IO uint32_t pio1_03; // 0x6c
  __IO uint32_t pio1_04; // 0x70
  __IO uint32_t pio1_05; // 0x74
  __IO uint32_t pio1_06; // 0x78
  __IO uint32_t pio1_07; // 0x7c

  __IO uint32_t pio1_08; // 0x80
  __IO uint32_t pio1_09; // 0x84
  __IO uint32_t pio1_10; // 0x88
  __IO uint32_t pio1_11; // 0x8c
  __IO uint32_t pio1_12; // 0x90
  __IO uint32_t pio1_13; // 0x94
  __IO uint32_t pio1_14; // 0x98
  __IO uint32_t pio1_15; // 0x9c

  __IO uint32_t pio1_16; // 0xa0
  __IO uint32_t pio1_17; // 0xa4
  __IO uint32_t pio1_18; // 0xa8
  __IO uint32_t pio1_19; // 0xac
  __IO uint32_t pio1_20; // 0xb0
  __IO uint32_t pio1_21; // 0xb4
  __IO uint32_t pio1_22; // 0xb8
  __IO uint32_t pio1_23; // 0xbc

  __IO uint32_t pio1_24; // 0xc0
  __IO uint32_t pio1_25; // 0xc4
  __IO uint32_t pio1_26; // 0xc8
  __IO uint32_t pio1_27; // 0xcc
  __IO uint32_t pio1_28; // 0xd0
  __IO uint32_t pio1_29; // 0xd4
  __IO uint32_t pio1_30; // 0xd8
  __IO uint32_t pio1_31; // 0xdc

  uint32_t : 32;         // 0xe0
  uint32_t : 32;         // 0xe4
  uint32_t : 32;         // 0xe8
  uint32_t : 32;         // 0xec
  __IO uint32_t pio2_00; // 0xf0
  __IO uint32_t pio2_01; // 0xf4
  uint32_t : 32;         // 0xf8
  __IO uint32_t pio2_02; // 0xfc

  __IO uint32_t pio2_03; // 0x100
  __IO uint32_t pio2_04; // 0x104
  __IO uint32_t pio2_05; // 0x108
  __IO uint32_t pio2_06; // 0x10c
  __IO uint32_t pio2_07; // 0x110
  __IO uint32_t pio2_08; // 0x114
  __IO uint32_t pio2_09; // 0x118
  __IO uint32_t pio2_10; // 0x11c

  __IO uint32_t pio2_11; // 0x120
  __IO uint32_t pio2_12; // 0x124
  __IO uint32_t pio2_13; // 0x128
  __IO uint32_t pio2_14; // 0x12c
  __IO uint32_t pio2_15; // 0x130
  __IO uint32_t pio2_16; // 0x134
  __IO uint32_t pio2_17; // 0x138
  __IO uint32_t pio2_18; // 0x13c

  __IO uint32_t pio2_19; // 0x140
  __IO uint32_t pio2_20; // 0x144
  __IO uint32_t pio2_21; // 0x148
  __IO uint32_t pio2_22; // 0x14c
  __IO uint32_t pio2_23; // 0x150

} IoconStruct;

#define IOCON ((IoconStruct *)IOCON_BASE)

// SYSCON
typedef struct SysConStruct
{
  __IO uint32_t SysMemRemap; // 0x000
  __IO uint32_t PResetCtrl;  // 0x004
  __IO uint32_t SysPllCtrl;  // 0x008
  __O uint32_t SysPllStat;   // 0x00c
  __IO uint32_t UsbPllCtrl;  // 0x010
  __O uint32_t UsbPllStat;   // 0x014
  uint32_t : 32;             // 0x018
  __IO uint32_t RtcOscCtrl;  // 0x01c

  __IO uint32_t SysOscCtrl; // 0x020
  __IO uint32_t WdtOscCtrl; // 0x024
  __IO uint32_t IrcCtrl;    // 0x028
  uint32_t : 32;            // 0x02c
  __IO uint32_t SysRstStat; // 0x030
  uint32_t : 32;            // 0x034
  uint32_t : 32;            // 0x038
  uint32_t : 32;            // 0x03c

  __IO uint32_t SysPllClkSel; // 0x040
  __IO uint32_t SysPllClkUEn; // 0x044
  __IO uint32_t UsbPllClkSel; // 0x048
  __IO uint32_t UsbPllClkUEn; // 0x04c
  uint32_t : 32;              // 0x050
  uint32_t : 32;              // 0x054
  uint32_t : 32;              // 0x058
  uint32_t : 32;              // 0x05c

  uint32_t : 32;              // 0x060
  uint32_t : 32;              // 0x064
  uint32_t : 32;              // 0x068
  uint32_t : 32;              // 0x06c
  __IO uint32_t MainClkSel;   // 0x070
  __IO uint32_t MainClkUEn;   // 0x074
  __IO uint32_t SysAhbClkDiv; // 0x078
  uint32_t : 32;              // 0x07c

  __IO uint32_t SysAhbClkCtrl; // 0x080
  uint32_t : 32;               // 0x084
  uint32_t : 32;               // 0x088
  uint32_t : 32;               // 0x08c
  uint32_t : 32;               // 0x90
  __IO uint32_t Ssp0ClkDiv;    // 0x094
  __IO uint32_t Usart0ClkDiv;  // 0x098
  __IO uint32_t Ssp1ClkDiv;    // 0x09c

  __IO uint32_t FrgClkDiv; // 0x0a0
  uint32_t : 32;           // 0x0a4
  uint32_t : 32;           // 0x0a8
  uint32_t : 32;           // 0x0ac
  uint32_t : 32;           // 0x0b0
  uint32_t : 32;           // 0x0b4
  uint32_t : 32;           // 0x0b8
  uint32_t : 32;           // 0x0bc

  __IO uint32_t UsbClkSel; // 0x0c0
  __IO uint32_t UsbClkUen; // 0x0c4
  __IO uint32_t UsbClkDiv; // 0x0c8
  uint32_t : 32;           // 0x0cc
  uint32_t : 32;           // 0x0d0
  uint32_t : 32;           // 0x0d4
  uint32_t : 32;           // 0x0d8
  uint32_t : 32;           // 0x0dc

  __IO uint32_t ClkOutSel;   // 0x0e0
  __IO uint32_t ClkOutUEn;   // 0x0e4
  __IO uint32_t ClkOutDiv;   // 0x0e8
  uint32_t : 32;             // 0x0ec
  __IO uint32_t UartFrgDiv;  // 0x0f0
  __IO uint32_t UartFrgMult; // 0x0f4
  uint32_t : 32;             // 0x0f8
  __IO uint32_t ExtTraceCmd; // 0x0fc

  __O uint32_t PioPorCap0; // 0x100
  __O uint32_t PioPorCap1; // 0x104
  __O uint32_t PioPorCap2; // 0x108
  uint32_t : 32;           // 0x10c
  uint32_t : 32;           // 0x110
  uint32_t : 32;           // 0x114
  uint32_t : 32;           // 0x118
  uint32_t : 32;           // 0x11c

  uint32_t : 32;              // 0x120
  uint32_t : 32;              // 0x124
  uint32_t : 32;              // 0x128
  uint32_t : 32;              // 0x12c
  uint32_t : 32;              // 0x130
  __IO uint32_t IoConClkDiv6; // 0x134
  __IO uint32_t IoConClkDiv5; // 0x138
  __IO uint32_t IoConClkDiv4; // 0x13c

  __IO uint32_t IoConClkDiv3; // 0x140
  __IO uint32_t IoConClkDiv2; // 0x144
  __IO uint32_t IoConClkDiv1; // 0x148
  __IO uint32_t IoConClkDiv0; // 0x14c
  __IO uint32_t BodCtrl;      // 0x150
  __IO uint32_t SysTckCal;    // 0x154
  uint32_t : 32;              // 0x158
  uint32_t : 32;              // 0x15c

  uint32_t : 32;            // 0x160
  uint32_t : 32;            // 0x164
  uint32_t : 32;            // 0x168
  uint32_t : 32;            // 0x16c
  __IO uint32_t IrqLatency; // 0x170
  __IO uint32_t NmiSrc;     // 0x174
  __IO uint32_t PintSel0;   // 0x178
  __IO uint32_t PintSel1;   // 0x17c

  __IO uint32_t PintSel2;   // 0x180
  __IO uint32_t PintSel3;   // 0x184
  __IO uint32_t PintSel4;   // 0x188
  __IO uint32_t PintSel5;   // 0x18c
  __IO uint32_t PintSel6;   // 0x190
  __IO uint32_t PintSel7;   // 0x194
  __IO uint32_t UsbClkCtrl; // 0x198
  __IO uint32_t UsbClkSt;   // 0x19c

  uint32_t : 32; // 0x1a0
  uint32_t : 32; // 0x1a4
  uint32_t : 32; // 0x1a8
  uint32_t : 32; // 0x1ac
  uint32_t : 32; // 0x1b0
  uint32_t : 32; // 0x1b4
  uint32_t : 32; // 0x1b8
  uint32_t : 32; // 0x1bc

  uint32_t : 32; // 0x1c0
  uint32_t : 32; // 0x1c4
  uint32_t : 32; // 0x1c8
  uint32_t : 32; // 0x1cc
  uint32_t : 32; // 0x1d0
  uint32_t : 32; // 0x1d4
  uint32_t : 32; // 0x1d8
  uint32_t : 32; // 0x1dc

  uint32_t : 32; // 0x1e0
  uint32_t : 32; // 0x1e4
  uint32_t : 32; // 0x1e8
  uint32_t : 32; // 0x1ec
  uint32_t : 32; // 0x1f0
  uint32_t : 32; // 0x1f4
  uint32_t : 32; // 0x1f8
  uint32_t : 32; // 0x1fc

  uint32_t : 32;           // 0x200
  __IO uint32_t StarterP0; // 0x204
  uint32_t : 32;           // 0x208
  uint32_t : 32;           // 0x20c
  uint32_t : 32;           // 0x210
  __IO uint32_t StarterP1; // 0x214
  uint32_t : 32;           // 0x218
  uint32_t : 32;           // 0x21c

  uint32_t : 32;            // 0x220
  uint32_t : 32;            // 0x224
  uint32_t : 32;            // 0x228
  uint32_t : 32;            // 0x22c
  __IO uint32_t PdSleepCfg; // 0x230
  __IO uint32_t PdAwakeCfg; // 0x234
  __IO uint32_t PdRunCfg;   // 0x238
  uint32_t : 32;            // 0x23c

  uint32_t Reserved15[220]; // 0x23c

  uint32_t : 32;         // 0x3f0
  __O uint32_t DeviceId; // 0x3f4
} SysConStruct;

#define SYSCON ((volatile SysConStruct *)SYSCON_BASE)

// I2C 0/1

typedef struct I2cStruct
{

  __IO uint32_t conset; // 0x00
  __O uint32_t stat;    // 0x04
  __IO uint32_t dat;    // 0x08
  __IO uint32_t adr0;   // 0x0c
  __IO uint32_t sclh;   // 0x10
  __IO uint32_t scll;   // 0x14
  __I uint32_t conclr;  // 0x18
  __IO uint32_t mmctrl; // 0x1c

