ogautherot/latticeice40-fw/include/lpc11u67.h
  __IO uint32_t adr1;       // 0x20
  __IO uint32_t adr2;       // 0x24
  __IO uint32_t adr3;       // 0x28
  __O uint32_t data_buffer; // 0x2c
  __IO uint32_t mask0;      // 0x30
  __IO uint32_t mask1;      // 0x34
  __IO uint32_t mask2;      // 0x38
  __IO uint32_t mask3;      // 0x3c
} I2cStruct;

#define I2C0 ((I2cStruct *)I2C0_BASE)
#define I2C1 ((I2cStruct *)I2C1_BASE)

// SPI 0/1

typedef struct SpiStruct
{
  __IO uint32_t cr0;  // 0x00
  __IO uint32_t cr1;  // 0x04
  __IO uint32_t dr;   // 0x08
  __O uint32_t sr;    // 0x0c
  __IO uint32_t cpsr; // 0x10
  __IO uint32_t imsc; // 0x14
  __IO uint32_t ris;  // 0x18
  __IO uint32_t mis;  // 0x1c

  __IO uint32_t icr;   // 0x20
  __IO uint32_t dmacr; // 0x24
} SpiStruct;

#define SPI0 ((SpiStruct *)SPI0_BASE)
#define SPI1 ((SpiStruct *)SPI1_BASE)

// USART 0/1/2/3/4

typedef struct Usart0Struct
{
  union
  {                    // 0x00
    __O uint32_t rbr;  // DLAB=0, receiver buffer register
    __I uint32_t thr;  // DLAB=0, transmit holding register
    __IO uint32_t dll; // DLAB=1, divisor latch LSB
  };
  union
  {                    // 0x04
    __IO uint32_t ier; // DLAB=0, interrupt enable register
    __IO uint32_t dlm; // DLAB=1, divisor latch MSB
  };
  union
  {                   // 0x08
    __O uint32_t iir; // Interrupt ID register
    __I uint32_t fcr; // FIFO control register
  };
  __IO uint32_t lcr; // 0x0c, line control register
  __IO uint32_t mcr; // 0x10, modem control register
  __IO uint32_t lsr; // 0x14, line status register
  __IO uint32_t msr; // 0x18, modem status register
  __IO uint32_t scr; // 0x1c, scratch pad register

  __IO uint32_t acr; // 0x20, auto-baud control
  __IO uint32_t icr; // 0x24
  __IO uint32_t fdr; // 0x28, fractional divider register
  __IO uint32_t osr; // 0x2c
  __IO uint32_t ter; // 0x30, transmit enable register
  uint32_t : 32;     // 0x34
  uint32_t : 32;     // 0x38
  uint32_t : 32;     // 0x3c

  __IO uint32_t hden;           // 0x40
  uint32_t : 32;                // 0x44
  __IO uint32_t scictrl;        // 0x48
  __IO uint32_t rs485ctrl;      // 0x4c, mode control
  __IO uint32_t rs485addrmatch; // 0x50, address match
  __IO uint32_t rs485dly;       // 0x54, direction control delay
  __IO uint32_t syncctrl;       // 0x58
} Usart0Struct;

#define UART0 ((Usart0Struct *)USART0_BASE)

// USART 1/2/3/4

// USART 0/1/2

typedef struct UsartStruct
{
  __IO uint32_t cfg;      // 0x00
  __IO uint32_t ctl;      // 0x04
  __IO uint32_t stat;     // 0x08
  __IO uint32_t intenset; // 0x0c
  __I uint32_t intenclr;  // 0x10
  __O uint32_t rxdat;     // 0x14
  __O uint32_t rxdatstat; // 0x18
  __IO uint32_t txdat;    // 0x1c

  __IO uint32_t brg;    // 0x20
  __O uint32_t intstat; // 0x24
  __IO uint32_t osr;    // 0x28
  __IO uint32_t addr;   // 0x2c
} UsartStruct;

#define UART1 ((UsartStruct *)USART1_BASE)
#define UART2 ((UsartStruct *)USART2_BASE)
#define UART3 ((UsartStruct *)USART3_BASE)
#define UART4 ((UsartStruct *)USART4_BASE)

// USB

typedef struct UsbStruct
{
  __IO uint32_t devcmdstat;   // 0x00
  __IO uint32_t info;         // 0x04
  __IO uint32_t epliststart;  // 0x08
  __IO uint32_t databufstart; // 0x0c
  __IO uint32_t lpm;          // 0x10
  __IO uint32_t epskip;       // 0x14
  __IO uint32_t epinuse;      // 0x18
  __IO uint32_t epbufcfg;     // 0x1c

  __IO uint32_t intstat;    // 0x20
  __IO uint32_t inten;      // 0x24
  __IO uint32_t intsetstat; // 0x28
  __IO uint32_t introuting; // 0x2c
  uint32_t : 32;            // 0x30
  __IO uint32_t eptoggle;   // 0x34
} UsbStruct;

#define USB ((UsbStruct *)USB_BASE)

// CRC

typedef struct CrcStruct
{
  __IO uint32_t mode;     // 0x00
  __IO uint32_t seed;     // 0x04
  __IO uint32_t sum_data; // 0x08
} CrcStruct;

#define CRC ((CrcStruct *)CRC_BASE)

// SCT

typedef struct SctStruct
{
  __IO uint32_t config; // 0x00
  union
  { // 0x04
    __IO uint32_t ctrl;
    struct
    {
      __IO uint16_t ctrl_l;
      __IO uint16_t ctrl_h;
    };
  };
  union
  { // 0x08
    __IO uint32_t limit;
    struct
    {
      __IO uint32_t limit_l;
      __IO uint32_t limit_h;
    };
  };
  union
  { // 0x0c
    __IO uint32_t halt;
    struct
    {
      __IO uint32_t halt_l;
      __IO uint32_t halt_h;
    };
  };
  union
  { // 0x10
    __IO uint32_t stop;
    struct
    {
      __IO uint32_t stop_l;
      __IO uint32_t stop_h;
    };
  };
  union
  { // 0x14
    __IO uint32_t start;
    struct
    {
      __IO uint32_t start_l;
      __IO uint32_t start_h;
    };
  };
  uint32_t : 32; // 0x18
  uint32_t : 32; // 0x1c

  uint32_t : 32; // 0x20
  uint32_t : 32; // 0x24
  uint32_t : 32; // 0x28
  uint32_t : 32; // 0x2c
  uint32_t : 32; // 0x30
  uint32_t : 32; // 0x34
  uint32_t : 32; // 0x38
  uint32_t : 32; // 0x3c

  union
  { // 0x40
    __IO uint32_t count;
    struct
    {
      __IO uint32_t count_l;
      __IO uint32_t count_h;
    };
  };
  union
  { // 0x44
    __IO uint32_t state;
    struct
    {
      __IO uint32_t state_l;
      __IO uint32_t state_h;
    };
  };
  __O uint32_t input; // 0x48
  union
  { // 0x4c
    __IO uint32_t regmode;
    struct
    {
      __IO uint32_t regmode_l;
      __IO uint32_t regmode_h;
    };
  };
  __IO uint32_t output;        // 0x50
  __IO uint32_t outputdirctrl; // 0x54
  __IO uint32_t res;           // 0x58
  __IO uint32_t dmareq0;       // 0x5c

  __IO uint32_t dmareq1; // 0x60
  uint32_t reserved[35];

  __IO uint32_t even;    // 0xf0
  __IO uint32_t evflag;  // 0xf4
  __IO uint32_t conen;   // 0xf8
  __IO uint32_t conflag; // 0xfc

  union
  {
    __IO uint32_t match[8];
    __IO uint32_t cap[8];
  };

  uint32_t reserved1[56];

  __IO uint32_t matchrel[8];

  uint32_t reserved2[56];

  struct
  {
    __IO uint32_t state;
    __IO uint32_t ctrl;
  } ev[8];

  uint32_t reserved3[48 + 64];

  struct
  {
    __IO uint32_t set;
    __IO uint32_t clr;
  } out[4];
} SctStruct;

#define SCT0 ((SctStruct *)SCT0_BASE)
#define SCT1 ((SctStruct *)SCT1_BASE)

// DMA

typedef struct DmaStruct
{
  __IO uint32_t ctrl;     // 0x00
  __O uint32_t intstat;   // 0x04
  __IO uint32_t srambase; // 0x08
  uint32_t : 32;          // 0x0c
  uint32_t : 32;          // 0x10
  uint32_t : 32;          // 0x14
  uint32_t : 32;          // 0x18
  uint32_t : 32;          // 0x1c

  __IO uint32_t enableset0; // 0x20
  uint32_t : 32;            // 0x14
  __I uint32_t enableclr0;  // 0x28
  uint32_t : 32;            // 0x2c
  __O uint32_t active0;     // 0x30
  uint32_t : 32;            // 0x34
  __O uint32_t busy0;       // 0x38
  uint32_t : 32;            // 0x3c

