ogautherot/latticeice40-fw/include/lpc11u67.h
  __IO uint32_t errint0;   // 0x40
  uint32_t : 32;           // 0x44
  __IO uint32_t intenset0; // 0x48
  uint32_t : 32;           // 0x4c
  __IO uint32_t intenclr0; // 0x50
  uint32_t : 32;           // 0x54
  __IO uint32_t inta0;     // 0x58
  uint32_t : 32;           // 0x5c

  __IO uint32_t intb0;    // 0x60
  uint32_t : 32;          // 0x64
  __I uint32_t setvalid0; // 0x68
  uint32_t : 32;
  __I uint32_t settrig0; // 0x70
  uint32_t : 32;         // 0x74
  __I uint32_t abort0;   // 0x78
  uint32_t : 32;         // 0x7c

  uint32_t reserved[224];

  struct
  {
    __IO uint32_t cfg;
    __O uint32_t ctlstat;
    __IO uint32_t xfercfg;
    uint32_t : 32;
  } ch[16];
} DmaStruct;

#define DMA ((DmaStruct *)DMA_BASE)

// GPIO

typedef struct GpioStruct
{
  __IO uint8_t byte_pin0[32];
  __IO uint8_t byte_pin1[32];
  __IO uint8_t byte_pin2[32];
  uint32_t reserved1[1000];

  __IO uint32_t word_pin0[32];
  __IO uint32_t word_pin1[32];
  __IO uint32_t word_pin2[32];
  uint32_t reserved2[928];

  __IO uint32_t dir0;
  __IO uint32_t dir1;
  __IO uint32_t dir2;
  uint32_t reserved3[29];

  __IO uint32_t mask0;
  __IO uint32_t mask1;
  __IO uint32_t mask2;
  uint32_t reserved4[29];

  __IO uint32_t pin0;
  __IO uint32_t pin1;
  __IO uint32_t pin2;
  uint32_t reserved5[29];

  __IO uint32_t mpin0;
  __IO uint32_t mpin1;
  __IO uint32_t mpin2;
  uint32_t reserved6[29];

  __IO uint32_t set0;
  __IO uint32_t set1;
  __IO uint32_t set2;
  uint32_t reserved7[29];

  __I uint32_t clr0;
  __I uint32_t clr1;
  __I uint32_t clr2;
  uint32_t reserved8[29];

  __I uint32_t xor0;
  __I uint32_t xor1;
  __I uint32_t xor2;
} GpioStruct;

#define GPIO0 ((GpioStruct *)GPIO0_BASE)

// GPIO GROUP interrupts

typedef struct GpioGrpStruct
{
  __IO uint32_t ctrl; // 0x00
  uint32_t : 32;      // 0x04
  uint32_t : 32;      // 0x08
  uint32_t : 32;      // 0x0c
  uint32_t : 32;      // 0x10
  uint32_t : 32;      // 0x14
  uint32_t : 32;      // 0x18
  uint32_t : 32;      // 0x1c

  __IO uint32_t pol0; // 0x20
  __IO uint32_t pol1; // 0x24
  __IO uint32_t pol2; // 0x28
  uint32_t : 32;      // 0x2c
  uint32_t : 32;      // 0x30
  uint32_t : 32;      // 0x34
  uint32_t : 32;      // 0x38
  uint32_t : 32;      // 0x3c

  __IO uint32_t ena0; // 0x40
  __IO uint32_t ena1; // 0x44
  __IO uint32_t ena2; // 0x48

} GpioGrpStruct;

#define GPIO_GRP0_BASE ((GpioGrpStruct *)GPIO_GRP0_BASE)

// GPIO PINT

typedef struct GpioPintStruct
{
  __IO uint32_t isel;   // 0x00
  __IO uint32_t ienr;   // 0x04
  __IO uint32_t sienr;  // 0x08
  __IO uint32_t cienr;  // 0x0c
  __IO uint32_t ienf;   // 0x10
  __IO uint32_t sienf;  // 0x14
  __IO uint32_t cienf;  // 0x18
  __IO uint32_t rise;   // 0x1c
  __IO uint32_t fall;   // 0x20
  __IO uint32_t ist;    // 0x24
  __IO uint32_t pmctrl; // 0x28
  __IO uint32_t pmsrc;  // 0x2c
  __IO uint32_t pmcfg;  // 0x30
} GpioPintStruct;

#define GPIO0_PINT ((GpioPintStruct *)GPIO0_PINT_BASE)

// // NVIC

typedef struct NvicStruct
{
  uint32_t reserved1[64];
  __IO uint32_t iser0;
  uint32_t reserved2[31];
  __IO uint32_t icer0;
  uint32_t reserved3[31];
  __IO uint32_t ispr0;
  uint32_t reserved4[31];
  __IO uint32_t icpr0;
  uint32_t reserved5[31];
  __IO uint32_t iabr0[8];
  uint32_t reserved5[63];
  __IO uint32_t ipr[8];
} NvicStruct;

#define NVIC ((NvicStruct *)NVIC_BASE)

// SysTick

typedef struct SystickStruct
{
  uint32_t : 32;
  uint32_t : 32;
  uint32_t : 32;
  uint32_t : 32;

  __IO uint32_t csr;
  __IO uint32_t rvr;
  __IO uint32_t cvr;
  __IO uint32_t calib;
} SystickStruct;

#define SYSTICK ((SystickStruct *)NVIC_BASE)

enum IrqMappingEnum
{
  IRQ_PINT0_0 = 0,
  IRQ_PINT0_1,
  IRQ_PINT0_2,
  IRQ_PINT0_3,
  IRQ_PINT0_4,
  IRQ_PINT0_5,
  IRQ_PINT0_6,
  IRQ_PINT0_7,
  IRQ_GINT0,     // 8
  IRQ_GINT1,     // 9
  IRQ_I2C1,      // 10
  IRQ_USART14,   // 11
  IRQ_USART23,   // 12
  IRQ_SCT01,     // 13
  IRQ_SSP1,      // 14
  IRQ_I2C0,      // 15
  IRQ_CT16B0,    // 16
  IRQ_CT16B1,    // 17
  IRQ_CT32B0,    // 18
  IRQ_CT32B1,    // 19
  IRQ_SSP0,      // 20
  IRQ_USART0,    // 21
  IRQ_USB,       // 22
  FIQ_USB,       // 23
  IRQ_ADC_A,     // 24
  IRQ_RTC,       // 25
  IRQ_BOD_WDT,   // 26
  IRQ_FLASH,     // 27
  IRQ_DMA,       // 28
  IRQ_ADC_B,     // 29
  IRQ_USB_WAKEUP // 23
};

#endif // __LPC11U67_H_INCLUDED__
